In [1]:
import numpy as np
import pandas as pd

# 데이터 병합
+ concat([대상들], join=공통컬럼, ignore_index=True)
+ merge
+ join

## 행 기준 결합 (long)

In [17]:
menu1 = pd.Series(['라면','짜장면','우동'], index=[1,2,3])
menu2 = pd.Series(['돈까스','피자','치킨'], index=[4,5,6])

In [3]:
pd.concat([menu1,menu2])

1     라면
2    짜장면
3     우동
4    돈까스
5     피자
6     치킨
dtype: object

In [12]:
df1 = pd.DataFrame({'menu':menu1})
df2 = pd.DataFrame({'menu':menu2})

In [13]:
pd.concat([df1,df2])  # 컬럼명이 같으므로 df1아래에 df2가 붙음

  menu
1   라면
2  짜장면
3   우동
4  돈까스
5   피자
6   치킨

### 열기준 결합 (wide)

In [15]:
pd.concat([menu1,menu2], axis=1)

     0    1
1   라면  NaN
2  짜장면  NaN
3   우동  NaN
4  NaN  돈까스
5  NaN   피자
6  NaN   치킨

In [19]:
menu3 = pd.Series(['라면','짜장면','우동'], index=[1,2,3])
menu4 = pd.Series(['돈까스','피자','치킨'], index=[1,2,3])

In [20]:
pd.concat([menu3,menu4], axis=1)

     0    1
1   라면  돈까스
2  짜장면   피자
3   우동   치킨

In [26]:
data1 = pd.DataFrame({'음식명': ['돈가스', '피자', '초밥', '치킨', '탕수육'],
                    '카테고리': ['일식', '양식', '일식', '양식', '중식']})
data2 = pd.DataFrame({'음식명': ['갈비탕', '냉면', '짜장면', '파스타', '라멘'],
                    '카테고리': ['한식', '한식', '중식', '양식', '일식']})
data3 = pd.DataFrame({'음식명': ['갈비탕', '냉면', '짜장면', '파스타', '라멘'],
                    '판매인기지역': ['서울', '부산', '제주', '제주', '서울']})

In [24]:
pd.concat([data1,data2], ignore_index=True)

   음식명 카테고리
0  돈가스   일식
1   피자   양식
2   초밥   일식
3   치킨   양식
4  탕수육   중식
5  갈비탕   한식
6   냉면   한식
7  짜장면   중식
8  파스타   양식
9   라멘   일식

In [25]:
pd.concat([data1,data2], axis=1)

   음식명 카테고리  음식명 카테고리
0  돈가스   일식  갈비탕   한식
1   피자   양식   냉면   한식
2   초밥   일식  짜장면   중식
3   치킨   양식  파스타   양식
4  탕수육   중식   라멘   일식

### 컬럼 기준 결합

In [28]:
data4 = pd.DataFrame({'음식명': ['돈가스', '피자', '초밥', '치킨', '탕수육', '갈비탕', '냉면', '짜장면', '파스타', '라멘'],
                    '카테고리': ['일식', '양식', '일식', '양식', '중식', '한식', '한식', '중식', '양식', '일식']})
data5 = pd.DataFrame({'음식명': ['탕수육', '짜장면', '돈가스', '치킨', '파스타', '갈비탕', '초밥'],
                    '판매인기지역': ['서울', '부산', '제주', '서울', '서울', '제주', '부산']})

In [27]:
pd.merge(data4,data5)  # 교집합

   음식명 카테고리 판매인기지역
0  돈가스   일식     제주
1   초밥   일식     부산
2   치킨   양식     서울
3  탕수육   중식     서울
4  갈비탕   한식     제주
5  짜장면   중식     부산
6  파스타   양식     서울

In [29]:
pd.merge(data4,data5, how='outer')  # 교집합 + 여집합

   음식명 카테고리 판매인기지역
0  돈가스   일식     제주
1   피자   양식    NaN
2   초밥   일식     부산
3   치킨   양식     서울
4  탕수육   중식     서울
5  갈비탕   한식     제주
6   냉면   한식    NaN
7  짜장면   중식     부산
8  파스타   양식     서울
9   라멘   일식    NaN

### 데이터프레임 그룹핑
* 특정조건에 따라 데이터들을 그룹으로 묶어서
 집계함수를 적용해서 통계정보를 출력
* 해당 그룹의 특성을 살펴볼 수 있음
* groupby(조건열).(집계함수)

In [44]:
pd.options.display.float_format = '{:,.2f}'.format

In [30]:
city = ['서울', '서울', '서울', '부산', '부산', '부산', '인천', '인천']
year = [2015, 2010, 2005, 2015, 2010, 2005, 2015, 2010]
pop = [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203]
region = ['수도권', '수도권', '수도권', '경상권', '경상권', '경상권', '수도권', '수도권']

In [31]:
data = {'도시':city, '년도':year, '인구수':pop, '지역':region}
df = pd.DataFrame(data, index=range(1,9))
df.head().style.format({'인구수':'{:,}'})

### 그룹핑 다뤄보기

In [32]:
# 도시별 그룹핑 
groupby = df.groupby('도시')
groupby.groups

{'부산': [4, 5, 6], '서울': [1, 2, 3], '인천': [7, 8]}

In [33]:
# 반복문으로 그룹핑 결과 확인
for gp, item in groupby:
    print(gp)
    print(item)

부산
   도시    년도      인구수   지역
4  부산  2015  3448737  경상권
5  부산  2010  3393191  경상권
6  부산  2005  3512547  경상권
서울
   도시    년도      인구수   지역
1  서울  2015  9904312  수도권
2  서울  2010  9631482  수도권
3  서울  2005  9762546  수도권
인천
   도시    년도      인구수   지역
7  인천  2015  2890451  수도권
8  인천  2010   263203  수도권

In [36]:
# 그룹핑 결과에 집계함수 적용 1
groupby['인구수'].sum()

도시
부산    10354475
서울    29298340
인천     3153654
Name: 인구수, dtype: int64

In [37]:
# 그룹핑 결과에 집계함수 적용 2
groupby['인구수'].agg(np.sum)

도시
부산    10354475
서울    29298340
인천     3153654
Name: 인구수, dtype: int64

In [38]:
# 그룹핑 결과에 집계함수 적용 3
groupby.sum(numeric_only=True)['인구수']

도시
부산    10354475
서울    29298340
인천     3153654
Name: 인구수, dtype: int64

### 도시별 평균 인구수
+ 객체명.groupby(그룹핑컬럼)[대상컬럼].집계함수

In [45]:
# df.groupby('도시').mean(numeric_only=True)['인구수']
df.groupby('도시')['인구수'].mean()

도시
부산   3,451,491.67
서울   9,766,113.33
인천   1,576,827.00
Name: 인구수, dtype: float64

### 연도별 총인구수

In [46]:
df.groupby('년도')['인구수'].sum()

년도
2005    13275093
2010    13287876
2015    16243500
Name: 인구수, dtype: int64

### 지역별 연도별 평균 인구수

In [47]:
df.groupby('지역')['인구수'].mean()

지역
경상권   3,451,491.67
수도권   6,490,398.80
Name: 인구수, dtype: float64

## 피벗테이블
* 소량 데이터는 별 다른 수고없이 통계분석이 가능
* 하지만, 대량의 데이터는 통계분석하기에 어려움
* 수많은 데이터 중에서 원하는 데이터만 골라서 테이블을 재구성한 것을 의미 - summary table
* pivot(행,열,대상)

### 도시별 연도별 평균 인구수

In [50]:
# long column table - stack table
df.groupby(['도시','년도'])['인구수'].mean()

도시  년도
부산  2005   3,512,547.00
    2010   3,393,191.00
    2015   3,448,737.00
서울  2005   9,762,546.00
    2010   9,631,482.00
    2015   9,904,312.00
인천  2010     263,203.00
    2015   2,890,451.00
Name: 인구수, dtype: float64

In [53]:
# wide column table - unstack table
df.pivot('도시','년도','인구수')

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_4016\4187069982.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.pivot will be keyword-only.
  df.pivot('도시','년도','인구수')

년도         2005         2010         2015
도시
부산 3,512,547.00 3,393,191.00 3,448,737.00
서울 9,762,546.00 9,631,482.00 9,904,312.00
인천          NaN   263,203.00 2,890,451.00

### pivot_table
* pivot과 groupby를 적당히 섞은 명령
* pivot에서 지원하지 않는 다양한 집계함수 사용가능
* pivot_table(대상,행,열,집계함수,총계여부)

In [58]:
# 도시별 연도별 평균 인구수
df.pivot_table('인구수','도시','년도')

년도         2005         2010         2015
도시
부산 3,512,547.00 3,393,191.00 3,448,737.00
서울 9,762,546.00 9,631,482.00 9,904,312.00
인천          NaN   263,203.00 2,890,451.00

In [59]:
# 연도별 도시별 평균 인구수
df.pivot_table('인구수','년도','도시')

도시             부산           서울           인천
년도
2005 3,512,547.00 9,762,546.00          NaN
2010 3,393,191.00 9,631,482.00   263,203.00
2015 3,448,737.00 9,904,312.00 2,890,451.00

## 팁 관련 데이터를 이용한 그룹핑

In [69]:
import seaborn as sns

tips = sns.load_dataset('tips')
tips.head()

   total_bill  tip     sex smoker  day    time  size
0       16.99 1.01  Female     No  Sun  Dinner     2
1       10.34 1.66    Male     No  Sun  Dinner     3
2       21.01 3.50    Male     No  Sun  Dinner     3
3       23.68 3.31    Male     No  Sun  Dinner     2
4       24.59 3.61  Female     No  Sun  Dinner     4

In [62]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.4 KB

In [75]:
# 성별 팁 현황 - 건수
tips.groupby('sex')['tip'].count()

sex
Male      157
Female     87
Name: tip, dtype: int64

In [77]:
# 성별 팁 현황 - 팁 총금액
tips.groupby('sex')['tip'].sum()

sex
Male     485.07
Female   246.51
Name: tip, dtype: float64

In [80]:
tips.pivot_table('tip','sex', aggfunc=sum)

          tip
sex
Male   485.07
Female 246.51

In [76]:
# 성별 요일별 팁 현황
tips.groupby(['sex','day'])['tip'].count()

sex     day
Male    Thur    30
        Fri     10
        Sat     59
        Sun     58
Female  Thur    32
        Fri      9
        Sat     28
        Sun     18
Name: tip, dtype: int64

In [79]:
tips.pivot_table('tip','sex','day', aggfunc=sum)

day     Thur   Fri    Sat    Sun
sex
Male   89.41 26.93 181.95 186.78
Female 82.42 25.03  78.45  60.61

In [82]:
# 팁을 준 고객의 성별 분류
tips.groupby(['sex'])['tip'].count()

sex
Male      157
Female     87
Name: tip, dtype: int64

In [81]:
# 성별 흡연/비흡연 고객 분류
tips.groupby(['sex','smoker'])['tip'].count()

sex     smoker
Male    Yes       60
        No        97
Female  Yes       33
        No        54
Name: tip, dtype: int64

In [83]:
tips.groupby(['sex','smoker'])['tip'].sum()

sex     smoker
Male    Yes      183.07
        No       302.00
Female  Yes       96.74
        No       149.77
Name: tip, dtype: float64

In [84]:
tips.pivot_table('tip','sex','smoker',aggfunc='sum')

smoker    Yes     No
sex
Male   183.07 302.00
Female  96.74 149.77

In [85]:
tips.pivot_table('tip','sex','smoker',aggfunc='count')

smoker  Yes  No
sex
Male     60  97
Female   33  54

In [86]:
# 식사인원별 팁 여부
tips.groupby('size')['tip'].count()

size
1      4
2    156
3     38
4     37
5      5
6      4
Name: tip, dtype: int64

In [87]:
tips.groupby('size')['tip'].sum()

size
1     5.75
2   402.84
3   128.94
4   153.01
5    20.14
6    20.90
Name: tip, dtype: float64

In [88]:
tips.pivot_table('tip','size', aggfunc='count')

      tip
size
1       4
2     156
3      38
4      37
5       5
6       4

In [89]:
tips.pivot_table('tip','size', aggfunc='sum')

        tip
size
1      5.75
2    402.84
3    128.94
4    153.01
5     20.14
6     20.90

## Employees 와 Departments 데이터 분석

In [90]:
# 사원 데이터에서 직책별 사원수 조회
# 사원 데이터에서 부서별 직책별 사원수 조회
# 사원 데이터에서 부서별 직책별 급여 현황
# 사원번호, 이름, 급여, 부서명 조회
# 부서명별 사원수 조회